app/Controllers/Admin.php

    public function editCompany()
    {
        $this->checkLogin(); // Ensure login is checked

        $companyModel = new CompanyModel();
        $data['company'] = $companyModel->first();
---
SELECT *
FROM `company`
 LIMIT 1

        }

        // Update the company record
        $companyModel->update(1, $data);
---
UPDATE `company` SET `name` = 'ALL IN ONE STORE', `description` = 'Your Trusted Electronics Consultant!', `logo` = '1727507216_72275662dba6fb878b98.jpeg'
WHERE `company`.`id` IN (1)