app/Controllers/Admin.php

    public function listTeam()
    {
        $this->checkLogin(); // Ensure login is checked

        $teamModel = new TeamModel();
        $data['title'] = 'All In One Store - Team Management';
        $data['team'] = $teamModel->findAll();
---
SELECT *
FROM `team`

    public function listHeroSlides()
    {
        $this->checkLogin(); // Ensure login is checked

        $heroModel = new HeroModel();
        $data['heroSlides'] = $heroModel->findAll();
---
SELECT *
FROM `hero_slides`