app/Controllers/Auth.php

    public function loginSubmit()
    {
        $model = new AdminModel();
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        // Find the admin by email
        $admin = $model->where('email', $email)->first();
---
SELECT *
FROM `admin`
WHERE `email` = 'suprii90@gmail.com'
 LIMIT 1