app/Controllers/Home.php

SELECT *
FROM `hero_slides`
ORDER BY `slide_order` ASC
SELECT *
FROM `company`
 LIMIT 1
SELECT *
FROM `team`
SELECT *
FROM `contacts`
 LIMIT 1
---
public function index()
{
    $companyModel = new CompanyModel();
    $teamModel = new TeamModel();
    $contactModel = new ContactModel();
    $heroModel = new HeroModel();

    $data['title'] = 'All In One Store - Home';
    $data['heroSlides'] = $heroModel->orderBy('slide_order', 'ASC')->findAll();
    $data['company'] = $companyModel->first();
    $data['team'] = $teamModel->findAll();
    $data['contact'] = $contactModel->first();